{"generatedBy": "keras v2.3.1", "modelTopology": {"keras_version": "2.3.1", "training_config": {"weighted_metrics": null, "loss_weights": null, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "amsgrad": false, "beta_1": 0.8999999761581421, "learning_rate": 9.999999747378752e-05, "epsilon": 1e-07, "decay": 0.0}, "class_name": "Adam"}, "sample_weight_mode": null}, "model_config": {"config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, null, null, 3], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "Conv1_pad", "config": {"name": "Conv1_pad", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "Conv1", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [2, 2], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "Conv1", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 32}, "class_name": "Conv2D", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]]}, {"name": "bn_Conv1", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "bn_Conv1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"name": "Conv1_relu", "config": {"name": "Conv1_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "expanded_conv_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "expanded_conv_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]]}, {"name": "expanded_conv_depthwise_relu", "config": {"name": "expanded_conv_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]]}, {"name": "expanded_conv_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "expanded_conv_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 16}, "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]]}, {"name": "expanded_conv_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "expanded_conv_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]]}, {"name": "block_1_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_1_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 96}, "class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]]}, {"name": "block_1_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_1_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]]}, {"name": "block_1_expand_relu", "config": {"name": "block_1_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]]}, {"name": "block_1_pad", "config": {"name": "block_1_pad", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]]}, {"name": "block_1_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_1_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]]}, {"name": "block_1_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_1_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]]}, {"name": "block_1_depthwise_relu", "config": {"name": "block_1_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]]}, {"name": "block_1_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_1_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 24}, "class_name": "Conv2D", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]]}, {"name": "block_1_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_1_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_1_project", 0, 0, {}]]]}, {"name": "block_2_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_2_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 144}, "class_name": "Conv2D", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]]}, {"name": "block_2_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_2_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]]}, {"name": "block_2_expand_relu", "config": {"name": "block_2_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]]}, {"name": "block_2_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_2_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]]}, {"name": "block_2_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_2_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]]}, {"name": "block_2_depthwise_relu", "config": {"name": "block_2_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]]}, {"name": "block_2_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_2_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 24}, "class_name": "Conv2D", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]]}, {"name": "block_2_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_2_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_2_project", 0, 0, {}]]]}, {"name": "block_2_add", "config": {"name": "block_2_add", "trainable": true, "dtype": "float32"}, "class_name": "Add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]]}, {"name": "block_3_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_3_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 144}, "class_name": "Conv2D", "inbound_nodes": [[["block_2_add", 0, 0, {}]]]}, {"name": "block_3_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_3_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]]}, {"name": "block_3_expand_relu", "config": {"name": "block_3_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]]}, {"name": "block_3_pad", "config": {"name": "block_3_pad", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]]}, {"name": "block_3_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_3_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]]}, {"name": "block_3_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_3_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]]}, {"name": "block_3_depthwise_relu", "config": {"name": "block_3_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]]}, {"name": "block_3_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_3_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 32}, "class_name": "Conv2D", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]]}, {"name": "block_3_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_3_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_3_project", 0, 0, {}]]]}, {"name": "block_4_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_4_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 192}, "class_name": "Conv2D", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]]}, {"name": "block_4_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_4_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]]}, {"name": "block_4_expand_relu", "config": {"name": "block_4_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]]}, {"name": "block_4_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_4_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]]}, {"name": "block_4_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_4_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]]}, {"name": "block_4_depthwise_relu", "config": {"name": "block_4_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]]}, {"name": "block_4_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_4_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 32}, "class_name": "Conv2D", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]]}, {"name": "block_4_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_4_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_4_project", 0, 0, {}]]]}, {"name": "block_4_add", "config": {"name": "block_4_add", "trainable": true, "dtype": "float32"}, "class_name": "Add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]]}, {"name": "block_5_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_5_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 192}, "class_name": "Conv2D", "inbound_nodes": [[["block_4_add", 0, 0, {}]]]}, {"name": "block_5_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_5_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]]}, {"name": "block_5_expand_relu", "config": {"name": "block_5_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]]}, {"name": "block_5_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_5_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]]}, {"name": "block_5_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_5_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]]}, {"name": "block_5_depthwise_relu", "config": {"name": "block_5_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]]}, {"name": "block_5_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_5_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 32}, "class_name": "Conv2D", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]]}, {"name": "block_5_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_5_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_5_project", 0, 0, {}]]]}, {"name": "block_5_add", "config": {"name": "block_5_add", "trainable": true, "dtype": "float32"}, "class_name": "Add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]]}, {"name": "block_6_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_6_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 192}, "class_name": "Conv2D", "inbound_nodes": [[["block_5_add", 0, 0, {}]]]}, {"name": "block_6_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_6_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]]}, {"name": "block_6_expand_relu", "config": {"name": "block_6_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]]}, {"name": "block_6_pad", "config": {"name": "block_6_pad", "data_format": "channels_last", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]]}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]]}, {"name": "block_6_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [2, 2], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_6_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "valid", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]]}, {"name": "block_6_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_6_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]]}, {"name": "block_6_depthwise_relu", "config": {"name": "block_6_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]]}, {"name": "block_6_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_6_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]]}, {"name": "block_6_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_6_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_6_project", 0, 0, {}]]]}, {"name": "block_7_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_7_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 384}, "class_name": "Conv2D", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]]}, {"name": "block_7_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_7_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]]}, {"name": "block_7_expand_relu", "config": {"name": "block_7_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]]}, {"name": "block_7_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_7_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]]}, {"name": "block_7_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_7_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]]}, {"name": "block_7_depthwise_relu", "config": {"name": "block_7_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]]}, {"name": "block_7_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_7_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]]}, {"name": "block_7_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_7_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_7_project", 0, 0, {}]]]}, {"name": "block_7_add", "config": {"name": "block_7_add", "trainable": true, "dtype": "float32"}, "class_name": "Add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]]}, {"name": "block_8_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_8_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 384}, "class_name": "Conv2D", "inbound_nodes": [[["block_7_add", 0, 0, {}]]]}, {"name": "block_8_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_8_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]]}, {"name": "block_8_expand_relu", "config": {"name": "block_8_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]]}, {"name": "block_8_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_8_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]]}, {"name": "block_8_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_8_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]]}, {"name": "block_8_depthwise_relu", "config": {"name": "block_8_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]]}, {"name": "block_8_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_8_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]]}, {"name": "block_8_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_8_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_8_project", 0, 0, {}]]]}, {"name": "block_8_add", "config": {"name": "block_8_add", "trainable": true, "dtype": "float32"}, "class_name": "Add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]]}, {"name": "block_9_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_9_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 384}, "class_name": "Conv2D", "inbound_nodes": [[["block_8_add", 0, 0, {}]]]}, {"name": "block_9_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_9_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]]}, {"name": "block_9_expand_relu", "config": {"name": "block_9_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]]}, {"name": "block_9_depthwise", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "depth_multiplier": 1, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "depthwise_constraint": null, "activity_regularizer": null, "name": "block_9_depthwise", "use_bias": false, "kernel_size": [3, 3], "dilation_rate": [1, 1], "padding": "same", "depthwise_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "depthwise_regularizer": null, "activation": "linear"}, "class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]]}, {"name": "block_9_depthwise_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_9_depthwise_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]]}, {"name": "block_9_depthwise_relu", "config": {"name": "block_9_depthwise_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]]}, {"name": "block_9_project", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_9_project", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]]}, {"name": "block_9_project_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_9_project_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_9_project", 0, 0, {}]]]}, {"name": "block_9_add", "config": {"name": "block_9_add", "trainable": true, "dtype": "float32"}, "class_name": "Add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]]}, {"name": "block_10_expand", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "name": "block_10_expand", "use_bias": false, "kernel_size": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "filters": 384}, "class_name": "Conv2D", "inbound_nodes": [[["block_9_add", 0, 0, {}]]]}, {"name": "block_10_expand_BN", "config": {"scale": true, "beta_regularizer": null, "gamma_regularizer": null, "dtype": "float32", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "momentum": 0.999, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "gamma_constraint": null, "name": "block_10_expand_BN", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]]}, {"name": "block_10_expand_relu", "config": {"name": "block_10_expand_relu", "threshold": 0.0, "negative_slope": 0.0, "dtype": "float32", "trainable": true, "max_value": 6.0}, "class_name": "ReLU", "inbound_nodes": [[["block_10_expand_BN", 